{
    "TITLE": "Thophile labs",
    "NAV": {
        "HOME": "Accueil",
        "PROJECTS": "Projets",
        "ABOUT": "A propos"
    },
    "FOOTER": {
        "MENTION": "Tout droit réservés"
    },
    "HOME": {
        "SECTION1": {
            "TITLE": "Théophile Montémont",
            "SUBTITLE": "Étudiant en informatique | hobbyiste passioné .",
            "LINK": "En apprendre plus"
        },
        "SECTION2": {
            "TITLE": "Je suis intéressé par beaucoup de domaines et j'apprécie partager mes projets.",
            "LINK": "Voir mes projets"
        },
        "SECTION3": {
            "TITLE": "Si vous avez des questions ou des commentaires, n'hésitez pas à me contacter.",
            "LINK": "Contactez moi"
        }
    },
    "PROJETS": {
        "SECTION1": {
            "HEADER": "Vous pouvez voir ici tous mes projets",
            "BUTTON": "Tous"
        },
        "SECTION2": {
            "NOPROJECTS": "Pas de projets disponible"
        },
        "CATEGORY": "Categorie"
    },
    "ABOUT": {
        "HEADER": "À Propos de moi",
        "ARTICLE": {
            "STUDIES": "Études",
            "P1": "J'ai toujours souhaité être utile à la société, mon talent naturel pour la logique m'a orienté vers un formation dans l'informatique après un Bac Scientifique. Je pense que l'informatique a une place importante dans la société, en tant qu'outil pour faciliter la vie de chacun mais également en tant que divertissement. Avec un tel rôle l'informatique est le choix parfait pour exploiter mes capacités tout en atteigant mes objectifs personels.",
            "HOBBIES": "Loisirs",
            "P2": "J'apprécie faire tout ce dont je suis capable par moi-même. J'ai découvert cette passion à l'âge de 6 ans lorsque j'ai été autorisé pour la première fois à utiliser une scie. Je n'ai jamais arrêté de réaliser des projets manuels depuis !\n\nJ'aime apprendre et je suis un grand fan de tous les gadgets esthétiques et inutiles mais l'argent ne tombe pas du ciel donc je ne peut pas acheter les dizaines d'objet que j'apprécie. La plupart du temps je regarde des tutoriels pour les réalisés moi même pour un dixième du prix. Quelquefois cela me coûte 10 fois plus, mais je finis toujours par apprendre quelque chose d'intéressant et je m'amuse beaucoup !"
        },
        "CONTACT": "Contact",
        "MAIL": " Mon Mail",
        "LINKEDIN": " Mon LinkedIn",
        "TWITTER": " Mon Twitter",
        "RESUME": {
            "HEADER": "Téléchargez mon cv",
            "DL": "Télécharger",
            "LASTUPLOAD": "Dernière mise à jour à :",
            "TIMEZONE": "fuseau horaire : GMT",
            "NORESUME": "Pas de cv disponible"
        }
    },
    "PROJECTS": {
        "0": {
            "ID": "0",
            "TITLE": "Module de traduction PHP avec base de données compatible",
            "CATEGORY": "PHP Developpement",
            "BANNER_IMAGE": "konnichiwa.png",
            "IMAGES": {
                "0": {
                    "FILENAME": "konnichiwa.png",
                    "LABEL": "Bonjour en 4 langues"
                }
            },
            "ARTICLE": {
                "0": {
                    "TITLE": "Origine du projet",
                    "PARAGRAPHS": {
                        "0": "Ce projet a été créé dans le but d'ajouter un support d'internationalisation au site thophilelabs.com.\nIl était également important pour moi de créer des modules réutilisables afin de rentabiliser au mieux le travail fourni. L'absence d'utilisation de gestionnaire de base de données découle des limitations techniques de l'hébergement web utilisé, qui est limité à une seule base de données.\nLe stockage par fichier json permet de garder cette unique base de données disponible pour d'autres projets à venir sur cet hébergement",
                        "1": "",
                        "2": "",
                        "3": "",
                        "4": ""
                    }
                },
                "1": {
                    "TITLE": "Fonctionnement",
                    "PARAGRAPHS": {
                        "0": "Le projet comprend la création de deux modules indépendants capable de fonctionner ensemble.\n\nLe premier est un module de base de donnée qui va stocker des données sous la forme d'objet JavaScript (JSON).\n\nLe Second permet de stocker des chaines de caractère et d'y accéder via leur chemin (objets JSON imbriqués) le fichier lu dépendra d'une locale qui définira la langue des chaines de caractères. Avec une locale et un chemin on peut donc obtenir une chaine de caractères. \n\nLorqu'ils fonctionnent ensembles, ces deux modules permettent de stocker le chemin d'une traduction en base de donnée et d'inscrire automatiquement la traduction dans le chemin correspondant dans le fichier de traduction de la locale courante."
                    }
                }
            },
            "LINKS": {
                "0": {
                    "TITLE": "Github",
                    "HREF": "https:\/\/github.com\/Thophile\/TranslatedDatabase"
                }
            }
        }
    }
}